app/Models/ES_equiposModel.php

SELECT *
FROM "ES_equipos"
WHERE "id" = '1'
---
    public function obtenerRegistroPorId($id) {
        return $this->where('id', $id)->findAll();

UPDATE "ES_equipos" SET "descripcion" = 'Equipo I                                                                                                                                                                                                                                                       ', "descripcion_equipo" = 'Equipo I de Pruebas                                                                                                                                                                                                                                            ', "area_id" = '1', "descripcion_area" = 'DAN', "centro_costo" = '123', "tipo_id" = '2', "tipo_descripcion" = 'Autoclave'
WHERE "ES_equipos"."id" IN ('1')
---
    public function editarRegistro($id, $data){
        return $this->update($id, $data);